1s/ERP/Conf/Documents/Лико_ЗабраковкаМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗабраковкаМатериалов</Name>
			<Comment>++ kit:mih web 08.07.21</Comment>
			<BasedOn>
				<xr:Item>Document.ТС_ЗаявкаНаРемонтРабочихЦентров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_БракСерий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОбнаружения</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_МестаОбнаруженияБракаМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОбнаружившийБрак</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дефект</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДефектыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДефекта</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РешенияПоБракуМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКРешению</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринявшийРешение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОформившийОбразец</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРезкиМатериала</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акт</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПретензии</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыПретензийПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыставленияПретензии</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОжиданияОтвета</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВозвратаПоставщику</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыВозвратовПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБрака</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательноеРешение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражКВМ</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражСтрокой</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоПоРешениюОтправлено</Name>
					<Comment>//++ kit:mih web 14.07.21  - Технический реквизит используется для отслеживания отправлено ли письмо на почту</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоКладовщикамОтправлено</Name>
					<Comment>//++ kit:mih web 14.07.21  - Технический реквизит используется для отслеживания отправлено ли письмо на почту</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>//Технический реквизит, необходим хранения документа основания</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовыйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбразцыПриложеныКНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражПМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныеНомераРоликов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетражПМ</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетражКВМ</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗабраковкаМатериалов/Forms/УдалитьФормаДокументаИнфопад/Ext/Form/Module.bsl
#Область СтандартныеПроцедуры

Перем глПодключаемоеОборудованиеСобытиеОбработано;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ kit:mih web 16.07.21
	Если Параметры.Свойство("СотрудникПринявшийРешение") Тогда
		Объект.СотрудникПринявшийРешение = Параметры.СотрудникПринявшийРешение;
	КонецЕсли;
	//-- kit:mih web 16.07.21
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//++ kit:mih web 11.07.21
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Автор = ?(ЗначениеЗаполнено(ГлЛико_Оператор), ГлЛико_Оператор, ПользователиКлиент.ТекущийПользователь());
	КонецЕсли;
	
	//Подключение внешнего оборудования
	ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	ЭтаФорма.Активизировать();
	
	Если НЕ ЗначениеЗаполнено(Объект.Номер) Тогда
		Записать();
		Объект.ЭтоНовыйДокумент = Истина;
	КонецЕсли;
	//-- kit:mih web 16.07.21

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Расчет МетражКВМ и заполнение МетражСтрокой //++ kit:mih web 16.07.21
	Объект.МетражСтрокой = "";
	Объект.МетражКВМ = 0;
	Для Каждого Строка Из Объект.Материалы Цикл
		
		Объект.МетражКВМ = Объект.МетражКВМ + Строка.МетражКВМ;
		Если Объект.МетражСтрокой = "" Тогда
			Объект.МетражСтрокой = "" + Строка.Нарезка + " - " +  Строка.МетражКВМ;
		Иначе
			Объект.МетражСтрокой = Объект.МетражСтрокой + ", " + Строка.Нарезка + " - " +  Строка.МетражКВМ;
		КонецЕсли;
		
	КонецЦикла;	
	
	//-- kit:mih web 16.07.21
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
		
	Если НЕ ЗакрытиеПоКнопке Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование //++ kit:mih web 16.07.21
	СтандартнаяОбработка = Ложь;
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			
			МассивСтруктурДанных = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			МассивШтрихКодов = Новый Массив;
			
			//Для Каждого ЭлементМассива Из МассивСтруктурДанных Цикл
			Если МассивСтруктурДанных.Количество() > 0 Тогда
				МассивШтрихКодов.Добавить(МассивСтруктурДанных[0].Штрихкод);
			КонецЕсли;
			//КонецЦикла;
			
			ОбработатьШтрихкоды(МассивШтрихКодов);	
			
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование  //-- kit:mih web 16.07.21
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкиКнопок

&НаКлиенте
Процедура Вниз(Команда) //++ kit:mih web 16.07.21
	
	ИндексТекущегоЭлементаКоллекции = Объект.Материалы.Индекс(
	Элементы.Материалы.ТекущиеДанные);
	КоличествоЭлементовКоллекции = Объект.Материалы.Количество();
	Если ИндексТекущегоЭлементаКоллекции < КоличествоЭлементовКоллекции - 1 Тогда
		Элементы.Материалы.ТекущаяСтрока =
		Объект.Материалы[ИндексТекущегоЭлементаКоллекции+1].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура Вверх(Команда) //++ kit:mih web 16.07.21
	
	ИндексТекущегоЭлементаКоллекции = Объект.Материалы.Индекс(
	Элементы.Материалы.ТекущиеДанные);
	Если ИндексТекущегоЭлементаКоллекции > 0  Тогда
		Элементы.Материалы.ТекущаяСтрока =
		Объект.Материалы[ИндексТекущегоЭлементаКоллекции-1].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура СохранитьДокумент(Команда) //++ kit:mih web 16.07.21
	
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
	Если НЕ ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Заказ клиента"" не заполнено",,"ЗаказКлиента","Объект.ЗаказКлиента"); 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Дефект) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Дефект"" не заполнено",,"Дефект","Объект.Дефект");
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СотрудникОбнаружившийБрак) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Сотрудник обнаружевший брак"" не заполнено",,"СотрудникОбнаружившийБрак","Объект.СотрудникОбнаружившийБрак");
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Решение) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Решение"" не заполнено",,"Решение","Объект.Решение");
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СотрудникПринявшийРешение) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Сотрудник принявший решение"" не заполнено",,"СотрудникПринявшийРешение","Объект.СотрудникПринявшийРешение");
	ИначеЕсли Объект.Материалы.Количество()=0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("В таблице ""Материалы"" нет материалов",,"Материалы","Объект.Материалы");
	Иначе
		ЗакрытиеПоКнопке = Истина;
		Оповестить("ЗакрытиеДокументаЗабраковки", Новый Структура("ЭтоНовыйДокумент, Основание", Объект.ЭтоНовыйДокумент, Объект.ДокументОснование), ЭтаФорма);
		Объект.ЭтоНовыйДокумент = Ложь;
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура ЗакрытьДокумент(Команда) //++ kit:mih web 16.07.21
	
	Модифицированность = Ложь;
	ЗакрытиеПоКнопке = Истина;
	
	Если Объект.ЭтоНовыйДокумент Тогда		
		//Установка пометки на удаление документа ЗабраковкаМатериалов
		УдалениеДокументаЗабраковкиНаСервере(Объект.Ссылка);
		Оповестить("УдалениеДокументаЗабраковки", Объект.ДокументОснование, ЭтаФорма);	
	КонецЕсли;
		
	ЭтаФорма.Закрыть();	 
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаСервере
Процедура УдалениеДокументаЗабраковкиНаСервере(СсылкаНаДокумент)
	
	ОбъектЗабраковки = СсылкаНаДокумент.ПолучитьОбъект();
	УстановитьПривилегированныйРежим(Истина);
	ОбъектЗабраковки.Удалить();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриАктивизацииЯчейки(Элемент) //++ kit:mih web 16.07.21
	
	Если Элемент.ТекущийЭлемент.Имя="МатериалыКоличество" Тогда 			
		СтруктураПараметров = Новый Структура;	
		СтруктураПараметров.Вставить("ТекстЗаголовка", "Введите количество");
		СтруктураПараметров.Вставить("ОбязательностьВвода", Ложь);
		СтруктураПараметров.Вставить("ЗапретНулевогоРезультата", Ложь);			
		СтруктураПараметров.Вставить("НабираемыйТекст", Элементы.Материалы.ТекущиеДанные.Количество);
		ОписаниеОповещения= Новый ОписаниеОповещения("УстановитьКоличество", ЭтаФорма);	
		ОткрытьФорму("ОбщаяФорма.ТСВиртуальнаяКлавиатураЦифровая", СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 		
		//ЭтаФорма.Элементы.Материалы.ТекущийЭлемент = ЭтаФорма.Элементы.Материалы.ПодчиненныеЭлементы.МатериалыКоличество;	
		ЭтаФорма.Элементы.Материалы.ВыделенныеСтроки.Очистить();
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя="МатериалыМетражПМ" Тогда 			
		СтруктураПараметров = Новый Структура;	
		СтруктураПараметров.Вставить("ТекстЗаголовка","Введите метраж ПМ");
		СтруктураПараметров.Вставить("ОбязательностьВвода", Ложь);
		СтруктураПараметров.Вставить("ЗапретНулевогоРезультата", Ложь);			
		СтруктураПараметров.Вставить("НабираемыйТекст", Элементы.Материалы.ТекущиеДанные.МетражПМ);
		ОписаниеОповещения= Новый ОписаниеОповещения("УстановитьМетражПМ",ЭтаФорма);	
		ОткрытьФорму("ОбщаяФорма.ТСВиртуальнаяКлавиатураЦифровая", СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 		
		//ЭтаФорма.Элементы.Материалы.ТекущийЭлемент = ЭтаФорма.Элементы.Материалы.ПодчиненныеЭлементы.МатериалыМетражПМ;
		ЭтаФорма.Элементы.Материалы.ВыделенныеСтроки.Очистить();
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя="МатериалыМетражКВМ" Тогда 			
		СтруктураПараметров = Новый Структура;	
		СтруктураПараметров.Вставить("ТекстЗаголовка", "Введите метраж КВ М");
		СтруктураПараметров.Вставить("ОбязательностьВвода", Ложь);
		СтруктураПараметров.Вставить("ЗапретНулевогоРезультата", Ложь);			
		СтруктураПараметров.Вставить("НабираемыйТекст", Элементы.Материалы.ТекущиеДанные.МетражКВМ);
		ОписаниеОповещения= Новый ОписаниеОповещения("УстановитьМетражКВМ", ЭтаФорма);	
		ОткрытьФорму("ОбщаяФорма.ТСВиртуальнаяКлавиатураЦифровая", СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 		
		//ЭтаФорма.Элементы.Материалы.ТекущийЭлемент = ЭтаФорма.Элементы.Материалы.ПодчиненныеЭлементы.МатериалыМетражКВМ;
		ЭтаФорма.Элементы.Материалы.ВыделенныеСтроки.Очистить();
	КонецЕсли;
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура УстановитьКоличество(Результат,Параметры) Экспорт //++ kit:mih web 16.07.21
	
	Если НЕ Результат = Неопределено Тогда	
		Элементы.Материалы.ТекущиеДанные.Количество = Результат;
	КонецЕсли;
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура УстановитьМетражПМ(Результат,Параметры) Экспорт //++ kit:mih web 16.07.21
	
	Если НЕ Результат = Неопределено Тогда	
		Элементы.Материалы.ТекущиеДанные.МетражПМ = Результат;	
	КонецЕсли;
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура УстановитьМетражКВМ(Результат,Параметры) Экспорт //++ kit:mih web 16.07.21
	
	Если НЕ Результат = Неопределено Тогда	
		Элементы.Материалы.ТекущиеДанные.МетражКВМ = Результат;
	КонецЕсли;

КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура ВвестиКомментарийКРешению(Команда) //++ kit:mih web 16.07.21
	
	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("ТекстЗаголовка", "Введите комментарий к решению");
	СтруктураПараметров.Вставить("ОбязательностьВвода", Ложь);
	СтруктураПараметров.Вставить("ЗапретНулевогоРезультата", Ложь);			
	СтруктураПараметров.Вставить("НабираемыйТекст", Объект.КомментарийКРешению);
	ОписаниеОповещения= Новый ОписаниеОповещения("УстановитьКомментарийКРешению", ЭтаФорма);	
	ОткрытьФорму("ОбщаяФорма.ТСВиртуальнаяКлавиатура", СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 		

КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура ВвестиОписаниеДефекта(Команда) //++ kit:mih web 16.07.21
		
	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("ТекстЗаголовка", "Введите описание дефекта");
	СтруктураПараметров.Вставить("ОбязательностьВвода", Ложь);
	СтруктураПараметров.Вставить("ЗапретНулевогоРезультата", Ложь);			
	СтруктураПараметров.Вставить("НабираемыйТекст", Объект.ОписаниеДефекта);
	ОписаниеОповещения= Новый ОписаниеОповещения("УстановитьОписаниеДефекта", ЭтаФорма);	
	ОткрытьФорму("ОбщаяФорма.ТСВиртуальнаяКлавиатура", СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 		

КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура УстановитьКомментарийКРешению(Результат,Параметры) Экспорт //++ kit:mih web 16.07.21	
	
	Если НЕ Результат = Неопределено Тогда
		Объект.КомментарийКРешению = Результат;	
	КонецЕсли;
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура УстановитьОписаниеДефекта(Результат,Параметры) Экспорт //++ kit:mih web 16.07.21
	
	Если НЕ Результат = Неопределено Тогда	
		Объект.ОписаниеДефекта = Результат;
	КонецЕсли;

КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура ВыборДефектаМатериалов(Команда) //++ kit:mih web 16.07.21
	
	ОписаниеОповещения= Новый ОписаниеОповещения("УстановитьДефектМатериала", ЭтаФорма);	
	ОткрытьФорму("Справочник.Лико_ДефектыМатериалов.Форма.ФормаВыбораИнфопад",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура УстановитьДефектМатериала(Результат,Параметры) Экспорт //++ kit:mih web 16.07.21
	
	Если НЕ Результат = Неопределено Тогда	
		Объект.Дефект = Результат;
	КонецЕсли;
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура ВыборРешения(Команда) //++ kit:mih web 16.07.21
	
	ОписаниеОповещения= Новый ОписаниеОповещения("УстановитьРешение", ЭтаФорма);	
	ОткрытьФорму("Справочник.Лико_РешенияПоБракуМатериалов.Форма.ФормаВыбораИнфопад",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура УстановитьРешение(Результат,Параметры) Экспорт //++ kit:mih web 16.07.21
	
	Если НЕ Результат = Неопределено Тогда	
		Объект.Решение = Результат;
	КонецЕсли;
	
КонецПроцедуры //-- kit:mih web 16.07.21

#КонецОбласти

#Область ПодключениеОборудованияИОбработкаШтрихКодов

&НаКлиенте
Процедура ОбработатьШтрихкоды(ШтрихКоды) //++ kit:mih web 16.07.21
	
	ДанныеОбъектовНоменклатур = Новый Соответствие;
	Для Каждого СтрокаДанных Из ШтрихКоды Цикл
		ДанныеОбъектовНоменклатур.Вставить(СтрокаДанных, Новый Структура);
	КонецЦикла;
	
	Лико_Дополнительно.ЗаполнениеКоллекцииОбъектовНоменклатурыПоШтрихКоду(ДанныеОбъектовНоменклатур, ШтрихКоды); 
	
	Для Каждого Запись Из ДанныеОбъектовНоменклатур Цикл
		
		Если Запись.Значение.Свойство("ОШИБКА") Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Невозможно обработать данный штрихкод");
			Прервать;
			
		КонецЕсли;
		
		Если НЕ ТипЗнч(Запись.Значение) = Тип("Структура") ИЛИ НЕ Запись.Значение.Свойство("НОМЕНКЛАТУРА") Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Невозможно обработать данный штрихкод");
			Прервать;
			
		Иначе
			
			НоваяСтрока = Объект.Материалы.Добавить();
			НоваяСтрока.Номенклатура = Запись.Значение["НОМЕНКЛАТУРА"];
			НоваяСтрока.Серия 		 = Запись.Значение["СЕРИЯ"];
			НоваяСтрока.Количество	 = Запись.Значение["КОЛИЧЕСТВО"];
			НоваяСтрока.МетражПМ     = Запись.Значение["КОЛИЧЕСТВО"];
			НоваяСтрока.МетражКВМ    = Запись.Значение["КОЛИЧЕСТВО"] * Запись.Значение["ЧИСЛИТЕЛЬ"];
			НоваяСтрока.Нарезка	     = Запись.Значение["НАРЕЗКА"];
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	//// ПодключаемоеОборудование //++ kit:mih web 16.07.21
	//// Подготовить данные
	//
	//ОписаниеСобытия = Новый Структура();
	//ОписаниеОшибки  = "";
	//
	//ОписаниеСобытия.Вставить("Источник", Источник);
	//ОписаниеСобытия.Вставить("Событие",  Событие);
	//ОписаниеСобытия.Вставить("Данные",   Данные);
	//
	//глПодключаемоеОборудованиеСобытиеОбработано = Ложь;
	//
	//// Передать на обработку данные.
	//Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	//Если Не Результат Тогда
	//    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При обработке внешнего события от устройства произошла ошибка.'")
	//                                                     + Символы.ПС + ОписаниеОшибки);
	//Иначе
	//	глПодключаемоеОборудованиеСобытиеОбработано = Истина;													 
	//КонецЕсли;
    // Конец ПодключаемоеОборудование //-- kit:mih web 16.07.21
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Отправка сообщений //++ kit:mih web 14.07.21
	Если ЗначениеЗаполнено(Объект.Решение) И НЕ Объект.ПисьмоПоРешениюОтправлено Тогда
		Лико_ДополнительноКлиент.НачатьОтправкуСообщения(Объект.Ссылка, "ПоРешению", ПользователиКлиент.ТекущийПользователь(), ПолучитьМакетНаСервере("ФормаПисьмаДляЭлектроннойПочты"));
		Объект.ПисьмоПоРешениюОтправлено = Истина;
		Записать();
	ИначеЕсли ЗначениеЗаполнено(Объект.ТипВозвратаПоставщику) И НЕ Объект.ПисьмоКладовщикамОтправлено Тогда
		Лико_ДополнительноКлиент.НачатьОтправкуСообщения(Объект.Ссылка, "Кладовщикам", ПользователиКлиент.ТекущийПользователь(), ПолучитьМакетНаСервере("ФормаПисьмаДляЭлектроннойПочты"));
		Объект.ПисьмоКладовщикамОтправлено = Истина;
		Записать();
	КонецЕсли;
	//-- kit:mih web 14.07.21

КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)//++ kit:mih web 14.07.21
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);	
	#КонецЕсли

КонецФункции //-- kit:mih web 14.07.21

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
КонецПроцедуры

#КонецОбласти
